const features = [
    { title: "Πανελλήνια Τηλεοπτικά Κανάλια", description: "Ζωντανή πρόσβαση σε τηλεοπτικά κανάλια από όλη την Ελλάδα." },
    { title: "Ελληνικές Σύγχρονες Ταινίες", description: "Παρακολουθήστε νέες ελληνικές ταινίες και σειρές με συνεχείς προσθήκες." },
    { title: "Ξένες Ταινίες με Ελληνικούς Υπότιτλους", description: "Απολαύστε βραβευμένες ξένες ταινίες με ελληνικούς υπότιτλους." },
    { title: "Ταινίες του Ελληνικού Παλιού Κινηματογράφου", description: "Δείτε κλασικές ελληνικές ταινίες από τον παλιό κινηματογράφο." },
    { title: "Παιδικές Ταινίες και Σειρές Μεταγλωττισμένες", description: "Ειδική κατηγορία για παιδιά με μεταγλωττισμένες παιδικές ταινίες και σειρές." },
    { title: "Προσθήκη Νέου Υλικού Καθημερινά", description: "Η βιβλιοθήκη εμπλουτίζεται καθημερινά με νέο περιεχόμενο." },
    { title: "Γρήγορη Φόρτωση Περιεχομένου", description: "Βελτιστοποιημένη ταχύτητα φόρτωσης για γρήγορη προβολή ταινιών και σειρών." },
    { title: "Δυνατότητα Φιλτραρίσματος", description: "Φιλτράρετε ταινίες με βάση το είδος, τη χρονολογία και τη διάρκεια τους." },
    { title: "Αποθήκευση Σημείου Προβολής", description: "Συνεχίστε την προβολή ταινίας από το τελευταίο σημείο που την αφήσατε." },
    { title: "Απομακρυσμένη Διαχείριση Περιεχομένου", description: "Διαχειριστείτε και ενημερώστε τη βιβλιοθήκη χωρίς εγκατάσταση πρόσθετων." },
    { title: "Άμεση Ενημέρωση της Βιβλιοθήκης", description: "Αυτόματες ενημερώσεις περιεχομένου χωρίς επιπλέον εγκαταστάσεις." },
    { title: "Διόρθωση Σφαλμάτων", description: "Επίλυση σφαλμάτων για πιο ομαλή και σταθερή εμπειρία χρήσης." },
    { title: "Άμεση Επικοινωνία με Προγραμματιστές", description: "Επικοινωνήστε απευθείας με την ομάδα υποστήριξης για οποιαδήποτε απορία." },
    { title: "Ελαχιστοποιημένο Μέγεθος Εγκατάστασης", description: "Η εφαρμογή απαιτεί μικρό αποθηκευτικό χώρο για εγκατάσταση." }
];

function loadFeatures() {
    const featureCarousel = document.querySelector('.feature-carousel');
    featureCarousel.innerHTML = features.map(feature => `
        <div class="feature">
            <h3>${feature.title}</h3>
            <p>${feature.description}</p>
        </div>
    `).join('');
}

document.addEventListener('DOMContentLoaded', function() {
    loadFeatures();
});
